EDT/УТ/src/Documents/КорректировкаПогрузкиЗаказовВАвто/КорректировкаПогрузкиЗаказовВАвто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаПогрузкиЗаказовВАвто</name>
  <registerRecords>InformationRegister.НезагруженныеЗаказыВАвто</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ПогрузкаИсточник</name>
      <type>
        <types>DocumentRef.ПогрузкаВАвто</types>
      </type>
    </attributes>
    <attributes>
      <name>ПогрузкаПриемник</name>
      <type>
        <types>DocumentRef.ПогрузкаВАвто</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимМодификации</name>
      <type>
        <types>EnumRef.РежимыМодификацииПогрузкиВАвто</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/НезагруженныеЗаказыВАвто/НезагруженныеЗаказыВАвто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НезагруженныеЗаказыВАвто</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусПогрузки</name>
    <type>
      <types>EnumRef.СтатусыПогрузкиЗаказовВАвто</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ЗаказыКОтвязкеОтРейсов/ЗаказыКОтвязкеОтРейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаказыКОтвязкеОтРейсов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗаказНайден</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ВосстановлениеРегламентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.ДоставкиСОтклонениямиКоличестваСписком</types>
      <types>DocumentRef.ПогрузкаВАвто</types>
      <types>DocumentRef.новаОтчетВодителя</types>
      <types>DocumentRef.ПредварительноеЗакрытиеРейса</types>
      <types>DocumentRef.КорректировкаПогрузкиЗаказовВАвто</types>
      <types>DocumentRef.ЗагрузкаСТСД</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОтвязки</name>
    <type>
      <types>EnumRef.ТипыОтвязкиЗаказовОтМашин</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/РежимыМодификацииПогрузкиВАвто/РежимыМодификацииПогрузкиВАвто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыМодификацииПогрузкиВАвто</name>
  <enumValues>
    <name>ДобавлениеЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ПерекидкаЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеКоличестваМест</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНеПоместился</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/СтатусыПогрузкиЗаказовВАвто/СтатусыПогрузкиЗаказовВАвто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПогрузкиЗаказовВАвто</name>
  <enumValues>
    <name>ЗаказНеЗагружен</name>
  </enumValues>
  <enumValues>
    <name>ЗаказЗагружен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ТипыОтвязкиЗаказовОтМашин/ТипыОтвязкиЗаказовОтМашин.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОтвязкиЗаказовОтМашин</name>
  <enumValues>
    <name>НеНайденныеЗаказы</name>
  </enumValues>
  <enumValues>
    <name>РоботЯндекса</name>
  </enumValues>
  <enumValues>
    <name>ПредварительноеЗакрытиеРейса</name>
  </enumValues>
  <enumValues>
    <name>ОтменаОтвязки</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНеПоместилсяВРейс</name>
  </enumValues>
  <enumValues>
    <name>ЗаказПоступилНеПолностью</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/КорректировкаПогрузкиЗаказовВАвто/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Зап = Новый запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	КорректировкаПогрузкиЗаказовВАвтоЗаказы.Заказ КАК Заказ,
	            |	ВЫБОР
	            |		КОГДА КорректировкаПогрузкиЗаказовВАвтоЗаказы.ПогрузкаИсточник.Рейс.ТерминалДоставки = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
	            |			ТОГДА КорректировкаПогрузкиЗаказовВАвтоЗаказы.ПогрузкаПриемник.Рейс.ТерминалДоставки
	            |		ИНАЧЕ КорректировкаПогрузкиЗаказовВАвтоЗаказы.ПогрузкаИсточник.Рейс.ТерминалДоставки
	            |	КОНЕЦ КАК Терминал
	            |ИЗ
	            |	Документ.КорректировкаПогрузкиЗаказовВАвто.Заказы КАК КорректировкаПогрузкиЗаказовВАвтоЗаказы
	            |ГДЕ
	            |	КорректировкаПогрузкиЗаказовВАвтоЗаказы.РежимМодификации = ЗНАЧЕНИЕ(Перечисление.РежимыМодификацииПогрузкиВАвто.ПерекидкаЗаказа)
	            |	И КорректировкаПогрузкиЗаказовВАвтоЗаказы.Ссылка.Ссылка = &Док";
				
	Зап.УстановитьПараметр("Док", Ссылка);			
	Рез = Зап.Выполнить().Выгрузить();
	
	
//+++ БАО 02.08.2017 №1550	

	//Список = Новый СписокЗначений;
	//Массив = Рез.ВыгрузитьКолонку("Заказ");
	//Список.ЗагрузитьЗначения(Массив);
	Список = Рез.Скопировать(, "Заказ, Терминал");
	
//--- БАО 02.08.2017 №1550

	
	lem.ЗафиксироватьМестонахождениеЗаказа(Список, Справочники.ВидыМестонахожденияЗаказа.НаСкладе, Ссылка);
	
	
	Движения.НезагруженныеЗаказыВАвто.Записывать = Истина;
	Движения.НезагруженныеЗаказыВАвто.Очистить();
	Для Каждого ТекСтрокаЗаказы Из Заказы Цикл
		Движение = Движения.НезагруженныеЗаказыВАвто.Добавить();
		Движение.Период = Дата;
		Движение.Заказ = ТекСтрокаЗаказы.Заказ;
		
		Если ЗначениеЗаполнено(ТекСтрокаЗаказы.ПогрузкаПриемник) Тогда
			Движение.Рейс = ТекСтрокаЗаказы.ПогрузкаПриемник.Рейс;
		ИначеЕсли ЗначениеЗаполнено(ТекСтрокаЗаказы.ПогрузкаИсточник) Тогда
			Движение.Рейс = ТекСтрокаЗаказы.ПогрузкаИсточник.Рейс;
		КонецЕсли;
		
		Если ТекСтрокаЗаказы.РежимМодификации = Перечисления.РежимыМодификацииПогрузкиВАвто.ЗаказНеПоместился Тогда
			Движение.СтатусПогрузки = Перечисления.СтатусыПогрузкиЗаказовВАвто.ЗаказНеЗагружен;
		Иначе
			Движение.СтатусПогрузки = Перечисления.СтатусыПогрузкиЗаказовВАвто.ЗаказЗагружен;
		КонецЕсли;			
	КонецЦикла;

	
	Попытка
		ОтражениеЗаказовВРегистреОтвязокОтРейсов();
	Исключение
		
	КонецПопытки;	
КонецПроцедуры


Процедура ОтражениеЗаказовВРегистреОтвязокОтРейсов() Экспорт
	Для Каждого Тек Из Заказы Цикл
		Если Тек.РежимМодификации = Перечисления.РежимыМодификацииПогрузкиВАвто.ПерекидкаЗаказа Или Тек.РежимМодификации = Перечисления.РежимыМодификацииПогрузкиВАвто.ДобавлениеЗаказа Тогда
			Наб = РегистрыСведений.ЗаказыКОтвязкеОтРейсов.СоздатьНаборЗаписей();
			ТекВр = ТекущаяДата();
			Наб.Отбор.Период.Установить(ТекВр);
			Наб.Отбор.Рейс.Установить(Тек.ПогрузкаПриемник.Рейс);
			
			
			
			Нов = Наб.Добавить();
			Нов.Период = ТекВр;
			Нов.Рейс = Тек.ПогрузкаПриемник.Рейс;
			Нов.Заказ = Тек.Заказ;
			Нов.ТипОтвязки = Перечисления.ТипыОтвязкиЗаказовОтМашин.ОтменаОтвязки;
			//РаботаСАдминкойСервер.ОчиститьТранспортПоЗаказу(Тек.Заказ.Номер); //оптимизировать
			
			// Якурнов 06.08.2018 14:05:14
			Нов.ДокументРегистратор = Ссылка;
			Наб.Записать();
			//Попытка
				РейсОбъект = Тек.ПогрузкаПриемник.Рейс.ПолучитьОбъект();
				РейсОбъект.Записать(РежимЗаписиДокумента.Запись);
				РейсОбъект.Записать(РежимЗаписиДокумента.Проведение);
			//Исключение
			//КонецПопытки;
		КонецеСли;
	КонецЦикла;	
КонецПроцедуры
